app/controllers/api/v1/rooms_controller.rb

  def create
    room = Room.create(
      name: params[:name],
      user_id: params[:userId],
      url: params[:url]
    )
---
INSERT INTO "rooms" ("name", "created_at", "updated_at", "user_id", "url") VALUES (?, ?, ?, ?, ?)  [["name", "Sala 10"], ["created_at", "2023-01-24 01:06:24.019060"], ["updated_at", "2023-01-24 01:06:24.019060"], ["user_id", 62], ["url", "https://www.youtube.com/watch?v=7KDRqBpT8NA"]]