app/controllers/api/v1/users_controller.rb

  def create
    user = User.create(
      name: params[:name],
      username: params[:userName],
      passoword: "123456"
    )
---
INSERT INTO "users" ("username", "passoword", "name", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["username", "Mariana2"], ["passoword", "123456"], ["name", "Mariana2"], ["created_at", "2023-01-23 21:17:10.789112"], ["updated_at", "2023-01-23 21:17:10.789112"]]